## 📝 Terraform Plan Result (dev)

```terraform
data.aws_ami.ubuntu_latest: Reading...
module.rds_mysql.aws_db_parameter_group.main: Refreshing state... [id=cherrypic-mysql-parameter-group]
module.eip_jenkins.aws_eip.main: Refreshing state... [id=eipalloc-0416fa4edb25f5c6f]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-057adc9a1eada1de9]
module.eip_was.aws_eip.main: Refreshing state... [id=eipalloc-0dcd414bd0f84fe86]
data.aws_ami.ubuntu_latest: Read complete after 0s [id=ami-01f71f215b23ba262]
module.public_subnet_2.aws_subnet.main: Refreshing state... [id=subnet-01db3e4fc3993cb65]
module.jenkins_dev_sg.aws_security_group.main: Refreshing state... [id=sg-00aeb2100f9a79a83]
module.private_subnet_1.aws_subnet.main: Refreshing state... [id=subnet-0954ef8a15a2713c1]
module.db_dev_sg.aws_security_group.main: Refreshing state... [id=sg-0152683282f8bb08c]
module.was_dev_sg.aws_security_group.main: Refreshing state... [id=sg-08d12b3a96ab9c2f1]
module.private_subnet_2.aws_subnet.main: Refreshing state... [id=subnet-0f52437b2467db9e5]
module.public_subnet_1.aws_subnet.main: Refreshing state... [id=subnet-057da2c4681ade9a7]
module.bastion_dev_sg.aws_security_group.main: Refreshing state... [id=sg-07de8c1a202bd8632]
module.public_route_table.aws_route_table.main: Refreshing state... [id=rtb-0b227b5ee413e49a1]
module.private_route_table.aws_route_table.main: Refreshing state... [id=rtb-035dc66d49319e396]
module.cache_dev_sg.aws_security_group.main: Refreshing state... [id=sg-07b667f240dcf3872]
module.internet_gateway.aws_internet_gateway.main: Refreshing state... [id=igw-07a84e87099bfca5f]
module.jenkins_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-3994768023]
module.jenkins_dev_sg.aws_security_group_rule.ingress_cidr["1"]: Refreshing state... [id=sgrule-1511241249]
module.jenkins_dev_sg.aws_security_group_rule.ingress_cidr["0"]: Refreshing state... [id=sgrule-582211358]
module.db_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-2073235641]
module.cache_dev.aws_elasticache_subnet_group.main: Refreshing state... [id=cherrypic-cache-subnet-group]
module.jenkins_dev.aws_instance.main: Refreshing state... [id=i-0c39c8e0d39feee3f]
module.public_subnet_1.aws_route_table_association.main: Refreshing state... [id=rtbassoc-01cdad2d0a5bda93f]
module.rds_mysql.aws_db_subnet_group.main: Refreshing state... [id=cherrypic-mysql-subnet-group]
module.public_subnet_2.aws_route_table_association.main: Refreshing state... [id=rtbassoc-083b8b88bc09a339c]
module.cache_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-4032836028]
module.bastion_dev_sg.aws_security_group_rule.ingress_cidr["0"]: Refreshing state... [id=sgrule-3098698296]
module.private_subnet_2.aws_route_table_association.main: Refreshing state... [id=rtbassoc-04e784358d4a7f289]
module.private_subnet_1.aws_route_table_association.main: Refreshing state... [id=rtbassoc-03032bb2f172435ef]
module.was_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-531428030]
module.bastion_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-918922030]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["3"]: Refreshing state... [id=sgrule-1194359448]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["0"]: Refreshing state... [id=sgrule-3276909209]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["1"]: Refreshing state... [id=sgrule-2943073778]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["2"]: Refreshing state... [id=sgrule-4055508781]
module.bastion_dev.aws_instance.main: Refreshing state... [id=i-03ec6ec9b2ed696e3]
module.rds_mysql.aws_db_instance.main: Refreshing state... [id=db-VWJ6TRMLIRQP7N5ISOWOU7IPGQ]
module.was_dev.aws_instance.main: Refreshing state... [id=i-0bcf161d291cb449d]
module.db_dev_sg.aws_security_group_rule.ingress_sg["1"]: Refreshing state... [id=sgrule-1940400422]
module.db_dev_sg.aws_security_group_rule.ingress_sg["0"]: Refreshing state... [id=sgrule-1230847356]
module.cache_dev_sg.aws_security_group_rule.ingress_sg["1"]: Refreshing state... [id=sgrule-4122072874]
module.cache_dev_sg.aws_security_group_rule.ingress_sg["0"]: Refreshing state... [id=sgrule-3477390192]
module.public_route_table.aws_route.igw[0]: Refreshing state... [id=r-rtb-0b227b5ee413e49a11080289494]
module.cache_dev.aws_elasticache_replication_group.main: Refreshing state... [id=cherrypic-cache-dev]
module.jenkins_dev.aws_eip_association.main[0]: Refreshing state... [id=eipassoc-0a68a06ac3326ab2f]
module.was_dev.aws_eip_association.main[0]: Refreshing state... [id=eipassoc-02689738aab8b8240]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.bastion_dev.aws_instance.main has changed
  ~ resource "aws_instance" "main" {
        id                                   = "i-03ec6ec9b2ed696e3"
      - public_ip                            = "13.124.179.214" -> null
        tags                                 = {
            "App"         = "cherrypic"
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-bastion"
            "Team"        = "backend"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bastion_dev.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:805472282514:instance/i-03ec6ec9b2ed696e3" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "ap-northeast-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-03ec6ec9b2ed696e3" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-09b31f8c43ad35630" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-186.ap-northeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.186" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"         = "cherrypic"
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "cherrypic-bastion"
            "Team"        = "backend"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0f12514cd04cd3af7" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```